coinApp/app/models/coin.rb

SELECT "coins"."value" FROM "coins"
---
    def self.total
         #grabbing all items from :value by using pluck and getting the sum
         #divided by 100 to get the precise dollar value added .0 at the time to get closest decimal point
            sum = Coin.pluck(:value).sum/100.0