coinApp/app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
    def index
        @coins = Coin.all

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @coin = Coin.find_by(id: params[:id])

INSERT INTO "coins" ("name", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "penny"], ["value", 1], ["created_at", "2020-03-21 01:52:27.921965"], ["updated_at", "2020-03-21 01:52:27.921965"]]
---
    def create
        @coin = Coin.new(name: params[:name], value: params[:value])

        if @coin.save!

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 4]]
---
    def destroy
        @coin = Coin.find_by(id: params[:id])
        if @coin
            @coin.count -=1
            @coin.destroy if @coin.count = 0